#include "kernel.h"

void GPIOInit(void)
{
    //flash
    LPC_GPIO4->DIR |= 1<<9;  //CSA Flash 1
    LPC_GPIO4->SET |= 1<<9;
    LPC_GPIO2->DIR |= 1<<9;  //CSB Flash 2
    LPC_GPIO2->SET |= 1<<9;
    
    //ZIGBEE
    ZIGBEE_RETH;
    ZIGBEE_CFGH;
    
    //开关量输入
    LPC_GPIO5->DIR &= ~(1ul<<0);  //P5.0
    LPC_GPIO2->DIR &= ~(1ul<<30); //P2.30
    
    //看门狗方向。
    WDDIR();                                                        
}

/***************************************************************************
**函数名称： BeepOut
**函数功能：开关蜂鸣器
**入口参数：N_100ms，100ms为单位计时，如传入参数为1，则蜂鸣器响100ms
**返回值：无
**创建者：杨朝旭
**创建日期：2016-3-29 17:42:54
**
**修改者：
**修改日期：
**修改内容：
***************************************************************************/
void BeepOut(uint8_t N_100ms)
{
    globalvar.BeepCount=N_100ms;
    if(N_100ms)
    {
	    BEEP_ON();
	}
    else
    {
	    BEEP_OFF();
    }
}

/*********************************************************************************************************
** 函数名称：RunLed1
** 函数描述：程序运行指示灯led1
** 输入参数：无
** 返回值  ：无
*********************************************************************************************************/
void RunLed1(void)
{
	WATCH_DOG();
	if(LED1STATUS==0)
    {
        LED1_OFF();
    }
	else
    {
        LED1_ON();
    }
}


