#include "kernel.h"

/********************************************************
**函数名称:UsDelay
**函数功能:延时1微秒
**输入参数:ulTime---延时ulTime微秒
**输出值  :无

**创建者  :黄豪民
**创建日期:2016-04-12
**注：CPU运行频率为120MHZ(PLL0的输出为120MHZ，CCLKSEL寄存器值为0x00000101)

**修改者  :
**修改日期:
**修改内容:
********************************************************/
void UsDelay(uint32_t ulTime)
{
	uint16_t i=0;
	while (ulTime--) {
			for (i=0;i<22; i++);
	}
}

/********************************************************
**函数名称:UsDelay
**函数功能:延时1毫秒
**输入参数:ulTime---延时ulTime毫秒
**输出值  :无

**创建者  :黄豪民
**创建日期:2016-04-12
**注：CPU运行频率为120MHZ(PLL0的输出为120MHZ，CCLKSEL寄存器值为0x00000101)

**修改者  :
**修改日期:
**修改内容:
********************************************************/
void MsDelay(uint32_t ulTime)
{
    while (ulTime--) {
      UsDelay(1000);
    }
}

