#include "kernel.h"

/***************************************************************************
**函数名称： CheckDate
**函数功能：检测输入日期是否合法
**入口参数：str:日期数组
**返回值：TRUE:日期合法，FALSE:日期不合法
**创建者：杨朝旭
**创建日期：2016-4-13 09:01:07
**
**修改者：
**修改日期：
**修改内容：
***************************************************************************/
uint8_t CheckDate(uint8_t * str)
{
    uint8_t     DayOfMon[12]={31,28,31,30,31,30,31,31,30,31,30,31};
    uint8_t     m,d;
    uint16_t    y;
    y=2000+BcdToHex(str[0]);
    m=BcdToHex(str[1]);
    d=BcdToHex(str[2]);
   
    if (((y%4) == 0 &&(y%100 != 0))||(y%400 == 0)) DayOfMon[1]+=1;//年
    if ((m>12)||(m < 1))  return FALSE;//月
    if (d>DayOfMon[m-1])  return FALSE;//日
    return TRUE;
}

/***************************************************************************
**函数名称： CheckTime
**函数功能：检测输入时间是否合法
**入口参数：str:时间数组
**返回值：TRUE:时间合法，FALSE:时间不合法
**创建者：杨朝旭
**创建日期：2016-4-13 09:01:47
**
**修改者：
**修改日期：
**修改内容：
***************************************************************************/
uint8_t CheckTime(uint8_t * str)
{
    if(BcdToHex(str[0])>23 || BcdToHex(str[1])>=60 || BcdToHex(str[2])>=60)
        return FALSE;
    return TRUE;
}

/***************************************************************************
**函数名称： AscToBcd
**函数功能：将两个字节的asc码转为BCD码
**入口参数：asc:需要转换的asc数组
**返回值：转换后的BCD码
**创建者：杨朝旭
**创建日期：2016-4-12 15:21:05
**
**修改者：
**修改日期：
**修改内容：
***************************************************************************/
uint8_t AscToBcd(uint8_t* asc)
{
    if((asc[1]>0x30))
        return (asc[0] -0x30)*0x10 + (asc[1]-0x30);
    else
        return (asc[0] -0x30)*0x10;
}

/***************************************************************************
**函数名称： AscToBcd
**函数功能：将两个字节的asc码转为BCD码
**入口参数：bcd:需要转换的BCD码
                                dest:bcd码转换后的asc码数组
**返回值：无
**创建者：杨朝旭
**创建日期：2016-4-12 15:23:05
**
**修改者：
**修改日期：
**修改内容：
***************************************************************************/
void BcdToAsc(uint8_t* dest,uint8_t bcd)
{
    *dest     = bcd/10 +0x30;
    *(dest+1) = bcd%10 +0x30;
}

/***************************************************************************
**函数名称： ltostr
**函数功能：将一个整型数按指定格式，格式为相应的字符串
**入口参数：str:格式后的字符串
                                val:需要格式的整型数
                                 base:指定格式值
**返回值：格式后的字符串
**创建者：杨朝旭
**创建日期：2016-4-12 15:33:42
**
**修改者：
**修改日期：
**修改内容：
***************************************************************************/
char* ltostr(char *str,uint32_t val, uint8_t base)
{
    ldiv_t r;
    r = ldiv(labs(val), base);
    if(r.quot > 0)  str = ltostr(str, r.quot, base);
    *str++ = "0123456789abcdefghijklmnopqrstuvwxyz"[(int)r.rem];
    *str   = '\0';
    return str;
}

/***************************************************************************
**函数名称： HexToBcd
**函数功能：将一个整型数格式为BCD码
**入口参数：sdt:需要格式化的整型数
**返回值：格式后的BCD码
**创建者：杨朝旭
**创建日期：2016-4-12 15:35:42
**
**修改者：
**修改日期：
**修改内容：
***************************************************************************/
uint32_t HexToBcd(uint32_t sdt)
{
    char buf[12];
    memset(buf,0,sizeof(buf));
    ltostr(buf,sdt, 16);
    return strtoul((char*)&buf[0],NULL,16);
}

/***************************************************************************
**函数名称： BcdToHex
**函数功能：将一个BCD码转为整型数
**入口参数：sdt:需要格式化的BCD码
**返回值：转化后的整型数
**创建者：杨朝旭
**创建日期：2016-4-12 15:37:42
**
**修改者：
**修改日期：
**修改内容：
***************************************************************************/
uint32_t BcdToHex(uint32_t sdt)
{
    uint32_t rd_h = 0;
    uint32_t rd_l = 0;
    char buf[12];
    memset(buf,0,sizeof(buf));
    rd_h = sdt/0x10000;
    rd_l = sdt%0x10000;
    memset(buf,0,sizeof(buf));
    ltostr(buf, rd_h, 16);
    rd_h = strtoul((char*)&buf[0],NULL,10)*10000;
    memset(buf,0,sizeof(buf));
    ltostr(buf, rd_l, 16);
    return rd_h+strtoul((char*)&buf[0],NULL,10);
}

/***************************************************************************
**函数名称： BcdbufToHex
**函数功能：将一个BCD数组转为整型数
**入口参数：buf:需要转化的BCD码数组
                                len:数组长度，一般为2或4
**返回值：转化后的整型数
**创建者：杨朝旭
**创建日期：2016-4-12 15:39:26
**
**修改者：
**修改日期：
**修改内容：
***************************************************************************/
uint32_t  BcdbufToHex(uint8_t* buf,uint8_t len)
{
    UnionU32 tmp;
    uint8_t n;
    uint32_t ull = 0;
    tmp.data = 0;

    if(len == 2)
    {
        tmp.rdcv[0] = buf[1];
        tmp.rdcv[1] = buf[0];
        return BcdToHex(tmp.data);
    }

    if(len == 4)
    {
        for(n=0; n<4; n++) tmp.rdcv[n] = buf[3-n];
        return BcdToHex(tmp.data);
    }
    return ull;
}

/***************************************************************************
**函数名称： Cmp2float
**函数功能：比较两个浮点数是否相等
**入口参数：vcmp1:浮点数1
                                vcmp2:浮点数2
**返回值：TRUE:两个值相等，FALSE:两个值不等
**创建者：杨朝旭
**创建日期：2016-4-12 15:41:14
**
**修改者：
**修改日期：
**修改内容：
***************************************************************************/
uint8_t Cmp2float(double vcmp1, double vcmp2)
{
    char   buf1[12] = {0};
    char   buf2[12] = {0};
    uint8_t len1, len2 = 0;
    sprintf((char*)&buf1[0],"%.02f", vcmp1);
    sprintf((char*)&buf2[0],"%.02f", vcmp2);
    len1 = strlen(buf1);
    len2 = strlen(buf2);
    len1 = (len1>=len2) ? len1 : len2;
    if(memcmp(buf1,buf2,len1) == 0) return TRUE;
    return FALSE;
}

/***************************************************************************
**函数名称： HexToBcdbuf
**函数功能：将一个整型数转为BCD码数组
**入口参数：sdt:需要转换的整型数
                                buf:转化后的BCD码数组
                                len:数组长度
**返回值：转化后的整型数
**创建者：杨朝旭
**创建日期：2016-4-12 15:43:26
**
**修改者：
**修改日期：
**修改内容：
***************************************************************************/
void HexToBcdbuf(uint32_t sdt, char* buf, uint8_t len)
{
    char str[16]= {0};
    uint8_t g,n,m,l = 0;
    if(len == 0) return;
    g = len-1;
    l = 11;
    m = 6;
    sprintf(str,"%012ld",sdt);
    for(n=0; n<m; n++)
    {
        buf[g] = ((str[l-1]-'0')<<4)+(str[l]-'0');
        if(g == 0) break;
        l -= 2;
        g -= 1;
    }
}

/***************************************************************************
**函数名称： FloatToBcdbuf
**函数功能：将一个浮点数转为BCD码数组
**入口参数：fdt:需要转换的浮点数
                                buf:转化后的BCD码数组
                                len:数组长度
**返回值：转化后的整型数
**创建者：杨朝旭
**创建日期：2016-4-12 15:45:41
**
**修改者：
**修改日期：
**修改内容：
***************************************************************************/
void FloatToBcdbuf(double fdt, char* buf, uint8_t len)
{
    char str[16]= {0};
    uint8_t g,n,m,l = 0;
    if(len == 0) return;
    sprintf(str,"%013.02f",fdt);
    buf[len-1] = ((str[11]-'0')<<4)+(str[12]-'0');
    g = len-2;
    l = 9;
    m = 5;

    for(n=0; n<m; n++)
    {
        buf[g] = ((str[l-1]-'0')<<4)+(str[l]-'0');
        if(g == 0) break;
        l -= 2;
        g -= 1;
    }
}

/***************************************************************************
**函数名称： FloatToAsciibuf
**函数功能：将一个浮点数转为ASC码数组
**入口参数：fdt:需要转换的浮点数
                                buf:转化后的ASC码数组
                                len:数组长度
**返回值：转化后的整型数
**创建者：杨朝旭
**创建日期：2016-4-12 15:46:49
**
**修改者：
**修改日期：
**修改内容：
***************************************************************************/
void FloatToAsciibuf(double fdt, char* buf, uint8_t len)
{
    char str[16]= {0};
    uint8_t g,n = 0;
    if(len < 3)   return;
    sprintf(str,"%013.02f",fdt);
    buf[len-1] = str[12];
    buf[len-2] = str[11];
    g = len-3;
    for(n=0; n<len-2; n++)
    {
        buf[g] = str[9-n];
        if(g==0) break;
        g--;
    }
}

/***************************************************************************
**函数名称： HexToAsciibuf
**函数功能：将一个整型数转为ASC码数组
**入口参数：fdt:需要转换的整型数
                                buf:转化后的ASC码数组
                                len:数组长度
**返回值：转化后的整型数
**创建者：杨朝旭
**创建日期：2016-4-12 15:47:49
**
**修改者：
**修改日期：
**修改内容：
***************************************************************************/
void HexToAsciibuf(uint32_t fdt,char *buf,uint8_t len)
{
    char str[16]= {0};
    uint8_t n = 0;
    if(len < 3)   return;
    memset(str,0,16);
    sprintf(str,"%012ld",fdt);
    for(n = 0; n < len; n ++)
    {
        buf[len -1-n] = str[11-n];
    }
}


